; domain
(define (domain driverlog)
  (:requirements :typing)
  (:types         location locatable - object
		driver truck package - locatable

  )
  (:predicates
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - package ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)


(:action load-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action unload-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action board-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action disembark-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action drive-truck
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location
    ?truck - truck)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action walk
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))


)

; problem
(define (problem DLOG-5-7-45)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	driver5 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	truck6 - truck
	truck7 - truck
	package1 - package
	package2 - package
	package3 - package
	package4 - package
	package5 - package
	package6 - package
	package7 - package
	package8 - package
	package9 - package
	package10 - package
	package11 - package
	package12 - package
	package13 - package
	package14 - package
	package15 - package
	package16 - package
	package17 - package
	package18 - package
	package19 - package
	package20 - package
	package21 - package
	package22 - package
	package23 - package
	package24 - package
	package25 - package
	package26 - package
	package27 - package
	package28 - package
	package29 - package
	package30 - package
	package31 - package
	package32 - package
	package33 - package
	package34 - package
	package35 - package
	package36 - package
	package37 - package
	package38 - package
	package39 - package
	package40 - package
	package41 - package
	package42 - package
	package43 - package
	package44 - package
	package45 - package
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	p0-1 - location
	p0-3 - location
	p0-4 - location
	p0-5 - location
	p1-5 - location
	p2-0 - location
	p3-2 - location
	p3-5 - location
	p5-4 - location
	)
	(:init
	(at driver1 s2)
	(at driver2 s4)
	(at driver3 s2)
	(at driver4 s4)
	(at driver5 s4)
	(at truck1 s4)
	(empty truck1)
	(at truck2 s2)
	(empty truck2)
	(at truck3 s4)
	(empty truck3)
	(at truck4 s3)
	(empty truck4)
	(at truck5 s3)
	(empty truck5)
	(at truck6 s1)
	(empty truck6)
	(at truck7 s3)
	(empty truck7)
	(at package1 s1)
	(at package2 s5)
	(at package3 s3)
	(at package4 s2)
	(at package5 s2)
	(at package6 s0)
	(at package7 s4)
	(at package8 s4)
	(at package9 s4)
	(at package10 s2)
	(at package11 s5)
	(at package12 s4)
	(at package13 s4)
	(at package14 s4)
	(at package15 s0)
	(at package16 s4)
	(at package17 s0)
	(at package18 s5)
	(at package19 s5)
	(at package20 s1)
	(at package21 s5)
	(at package22 s0)
	(at package23 s3)
	(at package24 s1)
	(at package25 s5)
	(at package26 s4)
	(at package27 s3)
	(at package28 s0)
	(at package29 s3)
	(at package30 s4)
	(at package31 s5)
	(at package32 s1)
	(at package33 s4)
	(at package34 s5)
	(at package35 s1)
	(at package36 s0)
	(at package37 s1)
	(at package38 s4)
	(at package39 s2)
	(at package40 s4)
	(at package41 s3)
	(at package42 s2)
	(at package43 s1)
	(at package44 s5)
	(at package45 s4)
	(path s0 p0-1)
	(path p0-1 s0)
	(path s1 p0-1)
	(path p0-1 s1)
	(path s0 p0-3)
	(path p0-3 s0)
	(path s3 p0-3)
	(path p0-3 s3)
	(path s0 p0-4)
	(path p0-4 s0)
	(path s4 p0-4)
	(path p0-4 s4)
	(path s0 p0-5)
	(path p0-5 s0)
	(path s5 p0-5)
	(path p0-5 s5)
	(path s1 p1-5)
	(path p1-5 s1)
	(path s5 p1-5)
	(path p1-5 s5)
	(path s2 p2-0)
	(path p2-0 s2)
	(path s0 p2-0)
	(path p2-0 s0)
	(path s3 p3-2)
	(path p3-2 s3)
	(path s2 p3-2)
	(path p3-2 s2)
	(path s3 p3-5)
	(path p3-5 s3)
	(path s5 p3-5)
	(path p3-5 s5)
	(path s5 p5-4)
	(path p5-4 s5)
	(path s4 p5-4)
	(path p5-4 s4)
	(link s0 s4)
	(link s4 s0)
	(link s0 s5)
	(link s5 s0)
	(link s1 s0)
	(link s0 s1)
	(link s2 s0)
	(link s0 s2)
	(link s2 s1)
	(link s1 s2)
	(link s2 s5)
	(link s5 s2)
	(link s3 s0)
	(link s0 s3)
	(link s3 s2)
	(link s2 s3)
	(link s3 s4)
	(link s4 s3)
	(link s3 s5)
	(link s5 s3)
	(link s4 s2)
	(link s2 s4)
	(link s5 s1)
	(link s1 s5)
)
	(:goal (and
	(at driver1 s3)
	(at driver2 s4)
	(at driver3 s1)
	(at driver4 s1)
	(at driver5 s5)
	(at truck1 s2)
	(at truck2 s2)
	(at truck3 s3)
	(at truck4 s3)
	(at truck6 s2)
	(at truck7 s1)
	(at package1 s3)
	(at package3 s0)
	(at package4 s5)
	(at package5 s1)
	(at package6 s5)
	(at package7 s3)
	(at package8 s0)
	(at package9 s2)
	(at package10 s0)
	(at package11 s1)
	(at package12 s0)
	(at package13 s4)
	(at package14 s0)
	(at package15 s2)
	(at package16 s3)
	(at package17 s1)
	(at package18 s0)
	(at package20 s1)
	(at package21 s1)
	(at package22 s5)
	(at package23 s3)
	(at package24 s1)
	(at package25 s2)
	(at package26 s0)
	(at package27 s0)
	(at package28 s0)
	(at package29 s5)
	(at package30 s1)
	(at package31 s0)
	(at package32 s0)
	(at package33 s4)
	(at package34 s0)
	(at package35 s5)
	(at package36 s3)
	(at package37 s0)
	(at package38 s1)
	(at package39 s5)
	(at package40 s3)
	(at package41 s2)
	(at package42 s3)
	(at package43 s2)
	(at package44 s2)
	(at package45 s4)
	))


)

; plan
1. (load-truck s3 package41 truck5)
   deleted: (at package41 s3)
   added: (in package41 truck5)
   goals met: 10 of 54
2. (board-truck driver4 s4 truck1)
   deleted: (at driver4 s4) (empty truck1)
   added: (driving driver4 truck1)
   goals met: 10 of 54
3. (unload-truck s3 package41 truck5)
   deleted: (in package41 truck5)
   added: (at package41 s3)
   goals met: 10 of 54
4. (board-truck driver3 s2 truck2)
   deleted: (at driver3 s2) (empty truck2)
   added: (driving driver3 truck2)
   goals met: 10 of 54
5. (load-truck s4 package9 truck1)
   deleted: (at package9 s4)
   added: (in package9 truck1)
   goals met: 10 of 54
6. (load-truck s4 package8 truck1)
   deleted: (at package8 s4)
   added: (in package8 truck1)
   goals met: 10 of 54
7. (load-truck s4 package7 truck1)
   deleted: (at package7 s4)
   added: (in package7 truck1)
   goals met: 10 of 54
8. (load-truck s4 package40 truck1)
   deleted: (at package40 s4)
   added: (in package40 truck1)
   goals met: 10 of 54
9. (drive-truck driver4 s4 s0 truck1)
   deleted: (at truck1 s4)
   added: (at truck1 s0)
   goals met: 10 of 54
10. (board-truck driver5 s4 truck3)
   deleted: (at driver5 s4) (empty truck3)
   added: (driving driver5 truck3)
   goals met: 10 of 54
11. (drive-truck driver4 s0 s5 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s5)
   goals met: 10 of 54
12. (load-truck s5 package44 truck1)
   deleted: (at package44 s5)
   added: (in package44 truck1)
   goals met: 10 of 54
13. (load-truck s5 package34 truck1)
   deleted: (at package34 s5)
   added: (in package34 truck1)
   goals met: 10 of 54
14. (drive-truck driver4 s5 s0 truck1)
   deleted: (at truck1 s5)
   added: (at truck1 s0)
   goals met: 10 of 54
15. (unload-truck s0 package8 truck1)
   deleted: (in package8 truck1)
   added: (at package8 s0)
   goals met: 11 of 54
16. (load-truck s0 package6 truck1)
   deleted: (at package6 s0)
   added: (in package6 truck1)
   goals met: 11 of 54
17. (drive-truck driver4 s0 s3 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s3)
   goals met: 11 of 54
18. (unload-truck s3 package7 truck1)
   deleted: (in package7 truck1)
   added: (at package7 s3)
   goals met: 12 of 54
19. (drive-truck driver4 s3 s5 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s5)
   goals met: 12 of 54
20. (unload-truck s5 package6 truck1)
   deleted: (in package6 truck1)
   added: (at package6 s5)
   goals met: 13 of 54
21. (drive-truck driver4 s5 s1 truck1)
   deleted: (at truck1 s5)
   added: (at truck1 s1)
   goals met: 13 of 54
22. (load-truck s1 package43 truck1)
   deleted: (at package43 s1)
   added: (in package43 truck1)
   goals met: 13 of 54
23. (load-truck s1 package37 truck1)
   deleted: (at package37 s1)
   added: (in package37 truck1)
   goals met: 13 of 54
24. (drive-truck driver4 s1 s0 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s0)
   goals met: 13 of 54
25. (unload-truck s0 package37 truck1)
   deleted: (in package37 truck1)
   added: (at package37 s0)
   goals met: 14 of 54
26. (load-truck s0 package36 truck1)
   deleted: (at package36 s0)
   added: (in package36 truck1)
   goals met: 14 of 54
27. (drive-truck driver4 s0 s3 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s3)
   goals met: 14 of 54
28. (load-truck s3 package41 truck1)
   deleted: (at package41 s3)
   added: (in package41 truck1)
   goals met: 14 of 54
29. (unload-truck s3 package40 truck1)
   deleted: (in package40 truck1)
   added: (at package40 s3)
   goals met: 15 of 54
30. (drive-truck driver4 s3 s2 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s2)
   goals met: 16 of 54
31. (unload-truck s2 package9 truck1)
   deleted: (in package9 truck1)
   added: (at package9 s2)
   goals met: 17 of 54
32. (drive-truck driver4 s2 s5 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s5)
   goals met: 16 of 54
33. (load-truck s5 package31 truck1)
   deleted: (at package31 s5)
   added: (in package31 truck1)
   goals met: 16 of 54
34. (drive-truck driver4 s5 s0 truck1)
   deleted: (at truck1 s5)
   added: (at truck1 s0)
   goals met: 16 of 54
35. (unload-truck s0 package34 truck1)
   deleted: (in package34 truck1)
   added: (at package34 s0)
   goals met: 17 of 54
36. (unload-truck s0 package31 truck1)
   deleted: (in package31 truck1)
   added: (at package31 s0)
   goals met: 18 of 54
37. (drive-truck driver4 s0 s1 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s1)
   goals met: 18 of 54
38. (load-truck s1 package35 truck1)
   deleted: (at package35 s1)
   added: (in package35 truck1)
   goals met: 18 of 54
39. (drive-truck driver4 s1 s2 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s2)
   goals met: 19 of 54
40. (drive-truck driver4 s2 s5 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s5)
   goals met: 18 of 54
41. (unload-truck s5 package35 truck1)
   deleted: (in package35 truck1)
   added: (at package35 s5)
   goals met: 19 of 54
42. (load-truck s5 package25 truck1)
   deleted: (at package25 s5)
   added: (in package25 truck1)
   goals met: 19 of 54
43. (drive-truck driver4 s5 s2 truck1)
   deleted: (at truck1 s5)
   added: (at truck1 s2)
   goals met: 20 of 54
44. (load-truck s2 package5 truck1)
   deleted: (at package5 s2)
   added: (in package5 truck1)
   goals met: 20 of 54
45. (unload-truck s2 package44 truck1)
   deleted: (in package44 truck1)
   added: (at package44 s2)
   goals met: 21 of 54
46. (unload-truck s2 package43 truck1)
   deleted: (in package43 truck1)
   added: (at package43 s2)
   goals met: 22 of 54
47. (drive-truck driver4 s2 s1 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s1)
   goals met: 21 of 54
48. (unload-truck s1 package5 truck1)
   deleted: (in package5 truck1)
   added: (at package5 s1)
   goals met: 22 of 54
49. (load-truck s1 package32 truck1)
   deleted: (at package32 s1)
   added: (in package32 truck1)
   goals met: 22 of 54
50. (drive-truck driver4 s1 s0 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s0)
   goals met: 22 of 54
51. (unload-truck s0 package32 truck1)
   deleted: (in package32 truck1)
   added: (at package32 s0)
   goals met: 23 of 54
52. (drive-truck driver4 s0 s3 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s3)
   goals met: 23 of 54
53. (unload-truck s3 package36 truck1)
   deleted: (in package36 truck1)
   added: (at package36 s3)
   goals met: 24 of 54
54. (load-truck s3 package3 truck1)
   deleted: (at package3 s3)
   added: (in package3 truck1)
   goals met: 24 of 54
55. (drive-truck driver4 s3 s0 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s0)
   goals met: 24 of 54
56. (unload-truck s0 package3 truck1)
   deleted: (in package3 truck1)
   added: (at package3 s0)
   goals met: 25 of 54
57. (load-truck s0 package22 truck1)
   deleted: (at package22 s0)
   added: (in package22 truck1)
   goals met: 25 of 54
58. (drive-truck driver4 s0 s1 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s1)
   goals met: 25 of 54
59. (drive-truck driver4 s1 s5 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s5)
   goals met: 25 of 54
60. (unload-truck s5 package22 truck1)
   deleted: (in package22 truck1)
   added: (at package22 s5)
   goals met: 26 of 54
61. (load-truck s5 package21 truck1)
   deleted: (at package21 s5)
   added: (in package21 truck1)
   goals met: 26 of 54
62. (drive-truck driver4 s5 s1 truck1)
   deleted: (at truck1 s5)
   added: (at truck1 s1)
   goals met: 26 of 54
63. (unload-truck s1 package21 truck1)
   deleted: (in package21 truck1)
   added: (at package21 s1)
   goals met: 27 of 54
64. (load-truck s1 package1 truck1)
   deleted: (at package1 s1)
   added: (in package1 truck1)
   goals met: 27 of 54
65. (drive-truck driver4 s1 s0 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s0)
   goals met: 27 of 54
66. (drive-truck driver4 s0 s2 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s2)
   goals met: 28 of 54
67. (unload-truck s2 package41 truck1)
   deleted: (in package41 truck1)
   added: (at package41 s2)
   goals met: 29 of 54
68. (drive-truck driver4 s2 s3 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s3)
   goals met: 28 of 54
69. (load-truck s3 package29 truck1)
   deleted: (at package29 s3)
   added: (in package29 truck1)
   goals met: 28 of 54
70. (drive-truck driver4 s3 s5 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s5)
   goals met: 28 of 54
71. (unload-truck s5 package29 truck1)
   deleted: (in package29 truck1)
   added: (at package29 s5)
   goals met: 29 of 54
72. (load-truck s5 package18 truck1)
   deleted: (at package18 s5)
   added: (in package18 truck1)
   goals met: 29 of 54
73. (drive-truck driver4 s5 s0 truck1)
   deleted: (at truck1 s5)
   added: (at truck1 s0)
   goals met: 29 of 54
74. (unload-truck s0 package18 truck1)
   deleted: (in package18 truck1)
   added: (at package18 s0)
   goals met: 30 of 54
75. (load-truck s0 package17 truck1)
   deleted: (at package17 s0)
   added: (in package17 truck1)
   goals met: 30 of 54
76. (drive-truck driver4 s0 s1 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s1)
   goals met: 30 of 54
77. (unload-truck s1 package17 truck1)
   deleted: (in package17 truck1)
   added: (at package17 s1)
   goals met: 31 of 54
78. (drive-truck driver4 s1 s2 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s2)
   goals met: 32 of 54
79. (unload-truck s2 package25 truck1)
   deleted: (in package25 truck1)
   added: (at package25 s2)
   goals met: 33 of 54
80. (drive-truck driver4 s2 s3 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s3)
   goals met: 32 of 54
81. (load-truck s3 package27 truck1)
   deleted: (at package27 s3)
   added: (in package27 truck1)
   goals met: 32 of 54
82. (drive-truck driver4 s3 s0 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s0)
   goals met: 32 of 54
83. (unload-truck s0 package27 truck1)
   deleted: (in package27 truck1)
   added: (at package27 s0)
   goals met: 33 of 54
84. (load-truck s0 package15 truck1)
   deleted: (at package15 s0)
   added: (in package15 truck1)
   goals met: 33 of 54
85. (drive-truck driver4 s0 s1 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s1)
   goals met: 33 of 54
86. (drive-truck driver4 s1 s2 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s2)
   goals met: 34 of 54
87. (unload-truck s2 package15 truck1)
   deleted: (in package15 truck1)
   added: (at package15 s2)
   goals met: 35 of 54
88. (drive-truck driver3 s2 s1 truck2)
   deleted: (at truck2 s2)
   added: (at truck2 s1)
   goals met: 34 of 54
89. (load-truck s2 package42 truck1)
   deleted: (at package42 s2)
   added: (in package42 truck1)
   goals met: 34 of 54
90. (load-truck s2 package4 truck1)
   deleted: (at package4 s2)
   added: (in package4 truck1)
   goals met: 34 of 54
91. (load-truck s2 package39 truck1)
   deleted: (at package39 s2)
   added: (in package39 truck1)
   goals met: 34 of 54
92. (drive-truck driver4 s2 s5 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s5)
   goals met: 33 of 54
93. (unload-truck s5 package4 truck1)
   deleted: (in package4 truck1)
   added: (at package4 s5)
   goals met: 34 of 54
94. (unload-truck s5 package39 truck1)
   deleted: (in package39 truck1)
   added: (at package39 s5)
   goals met: 35 of 54
95. (drive-truck driver4 s5 s2 truck1)
   deleted: (at truck1 s5)
   added: (at truck1 s2)
   goals met: 36 of 54
96. (load-truck s2 package10 truck1)
   deleted: (at package10 s2)
   added: (in package10 truck1)
   goals met: 36 of 54
97. (drive-truck driver4 s2 s3 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s3)
   goals met: 35 of 54
98. (unload-truck s3 package42 truck1)
   deleted: (in package42 truck1)
   added: (at package42 s3)
   goals met: 36 of 54
99. (unload-truck s3 package1 truck1)
   deleted: (in package1 truck1)
   added: (at package1 s3)
   goals met: 37 of 54
100. (drive-truck driver4 s3 s0 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s0)
   goals met: 37 of 54
101. (unload-truck s0 package10 truck1)
   deleted: (in package10 truck1)
   added: (at package10 s0)
   goals met: 38 of 54
102. (drive-truck driver4 s0 s1 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s1)
   goals met: 38 of 54
103. (disembark-truck driver4 s1 truck1)
   deleted: (driving driver4 truck1)
   added: (at driver4 s1) (empty truck1)
   goals met: 39 of 54
104. (load-truck s4 package38 truck3)
   deleted: (at package38 s4)
   added: (in package38 truck3)
   goals met: 39 of 54
105. (load-truck s4 package30 truck3)
   deleted: (at package30 s4)
   added: (in package30 truck3)
   goals met: 39 of 54
106. (load-truck s4 package26 truck3)
   deleted: (at package26 s4)
   added: (in package26 truck3)
   goals met: 39 of 54
107. (drive-truck driver5 s4 s0 truck3)
   deleted: (at truck3 s4)
   added: (at truck3 s0)
   goals met: 39 of 54
108. (unload-truck s0 package26 truck3)
   deleted: (in package26 truck3)
   added: (at package26 s0)
   goals met: 40 of 54
109. (walk driver1 s2 p3-2)
   deleted: (at driver1 s2)
   added: (at driver1 p3-2)
   goals met: 40 of 54
110. (walk driver1 p3-2 s3)
   deleted: (at driver1 p3-2)
   added: (at driver1 s3)
   goals met: 41 of 54
111. (board-truck driver1 s3 truck7)
   deleted: (at driver1 s3) (empty truck7)
   added: (driving driver1 truck7)
   goals met: 40 of 54
112. (drive-truck driver5 s0 s1 truck3)
   deleted: (at truck3 s0)
   added: (at truck3 s1)
   goals met: 40 of 54
113. (drive-truck driver5 s1 s5 truck3)
   deleted: (at truck3 s1)
   added: (at truck3 s5)
   goals met: 40 of 54
114. (load-truck s5 package11 truck3)
   deleted: (at package11 s5)
   added: (in package11 truck3)
   goals met: 40 of 54
115. (drive-truck driver5 s5 s1 truck3)
   deleted: (at truck3 s5)
   added: (at truck3 s1)
   goals met: 40 of 54
116. (unload-truck s1 package38 truck3)
   deleted: (in package38 truck3)
   added: (at package38 s1)
   goals met: 41 of 54
117. (unload-truck s1 package30 truck3)
   deleted: (in package30 truck3)
   added: (at package30 s1)
   goals met: 42 of 54
118. (drive-truck driver5 s1 s5 truck3)
   deleted: (at truck3 s1)
   added: (at truck3 s5)
   goals met: 42 of 54
119. (drive-truck driver1 s3 s4 truck7)
   deleted: (at truck7 s3)
   added: (at truck7 s4)
   goals met: 42 of 54
120. (load-truck s4 package16 truck7)
   deleted: (at package16 s4)
   added: (in package16 truck7)
   goals met: 42 of 54
121. (load-truck s4 package14 truck7)
   deleted: (at package14 s4)
   added: (in package14 truck7)
   goals met: 42 of 54
122. (drive-truck driver1 s4 s0 truck7)
   deleted: (at truck7 s4)
   added: (at truck7 s0)
   goals met: 42 of 54
123. (unload-truck s0 package14 truck7)
   deleted: (in package14 truck7)
   added: (at package14 s0)
   goals met: 43 of 54
124. (drive-truck driver1 s0 s3 truck7)
   deleted: (at truck7 s0)
   added: (at truck7 s3)
   goals met: 43 of 54
125. (unload-truck s3 package16 truck7)
   deleted: (in package16 truck7)
   added: (at package16 s3)
   goals met: 44 of 54
126. (drive-truck driver1 s3 s4 truck7)
   deleted: (at truck7 s3)
   added: (at truck7 s4)
   goals met: 44 of 54
127. (load-truck s4 package12 truck7)
   deleted: (at package12 s4)
   added: (in package12 truck7)
   goals met: 44 of 54
128. (drive-truck driver1 s4 s0 truck7)
   deleted: (at truck7 s4)
   added: (at truck7 s0)
   goals met: 44 of 54
129. (unload-truck s0 package12 truck7)
   deleted: (in package12 truck7)
   added: (at package12 s0)
   goals met: 45 of 54
130. (drive-truck driver5 s5 s1 truck3)
   deleted: (at truck3 s5)
   added: (at truck3 s1)
   goals met: 45 of 54
131. (unload-truck s1 package11 truck3)
   deleted: (in package11 truck3)
   added: (at package11 s1)
   goals met: 46 of 54
132. (drive-truck driver5 s1 s5 truck3)
   deleted: (at truck3 s1)
   added: (at truck3 s5)
   goals met: 46 of 54
133. (drive-truck driver3 s1 s2 truck2)
   deleted: (at truck2 s1)
   added: (at truck2 s2)
   goals met: 47 of 54
134. (drive-truck driver1 s0 s1 truck7)
   deleted: (at truck7 s0)
   added: (at truck7 s1)
   goals met: 48 of 54
135. (board-truck driver4 s1 truck6)
   deleted: (at driver4 s1) (empty truck6)
   added: (driving driver4 truck6)
   goals met: 47 of 54
136. (drive-truck driver4 s1 s2 truck6)
   deleted: (at truck6 s1)
   added: (at truck6 s2)
   goals met: 48 of 54
137. (disembark-truck driver1 s1 truck7)
   deleted: (driving driver1 truck7)
   added: (at driver1 s1) (empty truck7)
   goals met: 48 of 54
138. (drive-truck driver3 s2 s1 truck2)
   deleted: (at truck2 s2)
   added: (at truck2 s1)
   goals met: 47 of 54
139. (disembark-truck driver3 s1 truck2)
   deleted: (driving driver3 truck2)
   added: (at driver3 s1) (empty truck2)
   goals met: 48 of 54
140. (walk driver1 s1 p1-5)
   deleted: (at driver1 s1)
   added: (at driver1 p1-5)
   goals met: 48 of 54
141. (walk driver1 p1-5 s5)
   deleted: (at driver1 p1-5)
   added: (at driver1 s5)
   goals met: 48 of 54
142. (disembark-truck driver5 s5 truck3)
   deleted: (driving driver5 truck3)
   added: (at driver5 s5) (empty truck3)
   goals met: 49 of 54
143. (board-truck driver1 s5 truck3)
   deleted: (at driver1 s5) (empty truck3)
   added: (driving driver1 truck3)
   goals met: 49 of 54
144. (drive-truck driver1 s5 s3 truck3)
   deleted: (at truck3 s5)
   added: (at truck3 s3)
   goals met: 50 of 54
145. (disembark-truck driver1 s3 truck3)
   deleted: (driving driver1 truck3)
   added: (at driver1 s3) (empty truck3)
   goals met: 51 of 54
146. (drive-truck driver4 s2 s1 truck6)
   deleted: (at truck6 s2)
   added: (at truck6 s1)
   goals met: 50 of 54
147. (disembark-truck driver4 s1 truck6)
   deleted: (driving driver4 truck6)
   added: (at driver4 s1) (empty truck6)
   goals met: 51 of 54
148. (board-truck driver4 s1 truck1)
   deleted: (at driver4 s1) (empty truck1)
   added: (driving driver4 truck1)
   goals met: 50 of 54
149. (drive-truck driver4 s1 s2 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s2)
   goals met: 51 of 54
150. (board-truck driver3 s1 truck6)
   deleted: (at driver3 s1) (empty truck6)
   added: (driving driver3 truck6)
   goals met: 50 of 54
151. (drive-truck driver3 s1 s2 truck6)
   deleted: (at truck6 s1)
   added: (at truck6 s2)
   goals met: 51 of 54
152. (walk driver5 s5 p1-5)
   deleted: (at driver5 s5)
   added: (at driver5 p1-5)
   goals met: 50 of 54
153. (walk driver5 p1-5 s1)
   deleted: (at driver5 p1-5)
   added: (at driver5 s1)
   goals met: 50 of 54
154. (board-truck driver5 s1 truck2)
   deleted: (at driver5 s1) (empty truck2)
   added: (driving driver5 truck2)
   goals met: 50 of 54
155. (drive-truck driver5 s1 s2 truck2)
   deleted: (at truck2 s1)
   added: (at truck2 s2)
   goals met: 51 of 54
156. (drive-truck driver5 s2 s3 truck2)
   deleted: (at truck2 s2)
   added: (at truck2 s3)
   goals met: 50 of 54
157. (disembark-truck driver5 s3 truck2)
   deleted: (driving driver5 truck2)
   added: (at driver5 s3) (empty truck2)
   goals met: 50 of 54
158. (walk driver5 s3 p3-5)
   deleted: (at driver5 s3)
   added: (at driver5 p3-5)
   goals met: 50 of 54
159. (walk driver5 p3-5 s5)
   deleted: (at driver5 p3-5)
   added: (at driver5 s5)
   goals met: 51 of 54
160. (board-truck driver1 s3 truck2)
   deleted: (at driver1 s3) (empty truck2)
   added: (driving driver1 truck2)
   goals met: 50 of 54
161. (drive-truck driver1 s3 s2 truck2)
   deleted: (at truck2 s3)
   added: (at truck2 s2)
   goals met: 51 of 54
162. (disembark-truck driver1 s2 truck2)
   deleted: (driving driver1 truck2)
   added: (at driver1 s2) (empty truck2)
   goals met: 51 of 54
163. (walk driver1 s2 p3-2)
   deleted: (at driver1 s2)
   added: (at driver1 p3-2)
   goals met: 51 of 54
164. (walk driver1 p3-2 s3)
   deleted: (at driver1 p3-2)
   added: (at driver1 s3)
   goals met: 52 of 54
165. (drive-truck driver4 s2 s5 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s5)
   goals met: 51 of 54
166. (disembark-truck driver4 s5 truck1)
   deleted: (driving driver4 truck1)
   added: (at driver4 s5) (empty truck1)
   goals met: 51 of 54
167. (walk driver4 s5 p1-5)
   deleted: (at driver4 s5)
   added: (at driver4 p1-5)
   goals met: 51 of 54
168. (walk driver4 p1-5 s1)
   deleted: (at driver4 p1-5)
   added: (at driver4 s1)
   goals met: 52 of 54
169. (walk driver1 s3 p3-5)
   deleted: (at driver1 s3)
   added: (at driver1 p3-5)
   goals met: 51 of 54
170. (walk driver1 p3-5 s5)
   deleted: (at driver1 p3-5)
   added: (at driver1 s5)
   goals met: 51 of 54
171. (board-truck driver1 s5 truck1)
   deleted: (at driver1 s5) (empty truck1)
   added: (driving driver1 truck1)
   goals met: 51 of 54
172. (drive-truck driver1 s5 s2 truck1)
   deleted: (at truck1 s5)
   added: (at truck1 s2)
   goals met: 52 of 54
173. (disembark-truck driver1 s2 truck1)
   deleted: (driving driver1 truck1)
   added: (at driver1 s2) (empty truck1)
   goals met: 52 of 54
174. (walk driver1 s2 p3-2)
   deleted: (at driver1 s2)
   added: (at driver1 p3-2)
   goals met: 52 of 54
175. (walk driver1 p3-2 s3)
   deleted: (at driver1 p3-2)
   added: (at driver1 s3)
   goals met: 53 of 54
176. (drive-truck driver3 s2 s5 truck6)
   deleted: (at truck6 s2)
   added: (at truck6 s5)
   goals met: 52 of 54
177. (disembark-truck driver3 s5 truck6)
   deleted: (driving driver3 truck6)
   added: (at driver3 s5) (empty truck6)
   goals met: 52 of 54
178. (walk driver3 s5 p1-5)
   deleted: (at driver3 s5)
   added: (at driver3 p1-5)
   goals met: 52 of 54
179. (walk driver3 p1-5 s1)
   deleted: (at driver3 p1-5)
   added: (at driver3 s1)
   goals met: 53 of 54
180. (board-truck driver5 s5 truck6)
   deleted: (at driver5 s5) (empty truck6)
   added: (driving driver5 truck6)
   goals met: 52 of 54
181. (drive-truck driver5 s5 s3 truck6)
   deleted: (at truck6 s5)
   added: (at truck6 s3)
   goals met: 52 of 54
182. (disembark-truck driver5 s3 truck6)
   deleted: (driving driver5 truck6)
   added: (at driver5 s3) (empty truck6)
   goals met: 52 of 54
183. (walk driver5 s3 p3-5)
   deleted: (at driver5 s3)
   added: (at driver5 p3-5)
   goals met: 52 of 54
184. (walk driver5 p3-5 s5)
   deleted: (at driver5 p3-5)
   added: (at driver5 s5)
   goals met: 53 of 54
185. (board-truck driver1 s3 truck6)
   deleted: (at driver1 s3) (empty truck6)
   added: (driving driver1 truck6)
   goals met: 52 of 54
186. (drive-truck driver1 s3 s2 truck6)
   deleted: (at truck6 s3)
   added: (at truck6 s2)
   goals met: 53 of 54
187. (disembark-truck driver1 s2 truck6)
   deleted: (driving driver1 truck6)
   added: (at driver1 s2) (empty truck6)
   goals met: 53 of 54
188. (walk driver1 s2 p3-2)
   deleted: (at driver1 s2)
   added: (at driver1 p3-2)
   goals met: 53 of 54
189. (walk driver1 p3-2 s3)
   deleted: (at driver1 p3-2)
   added: (at driver1 s3)
   goals met: 54 of 54
